{
    "data" : [
        {
            "id": 1,
            "blogCategory": "When Manifesting Your Desires...",
            "blogTitle" : "Always Stay Positive",
            "slug": "Always-Stay-Positive",
            "postedOn": "February 09, 2021",
            "author": "Pratiksha Patil",
            "blogImage": "https://monochromepink.com/wp-content/uploads/2019/04/happy-girl-sparklers.jpg",
            "blogText": "Tough times do not last forever. There is a light at the end of every tunnel. If you’ve been feeling like a dark cloud is continually hanging over your head, here are some things to keep in mind. Make a gratitude list, you can't be happy and sad in the same space. When times are hard, write down a list of all the reasons you’re grateful. You may be surprised at how many things are on that list.Writing the list may not make things better, but it is guaranteed to change your perspective or the way of thinking towards the situation.Take a break ,human mind body and soul can only run for so long without a break. In conjunction with a bad diet, overconsumption of alcohol, lack of sleep, overstimulation from social media, climate change and many more. It’s totally fine to take a break. No matter who you're please take care of yourself. Your family and friends need you.Set Limitations,Setting limitations is another way to stay positive during tough times. Maybe you need to turn off your phone for a few days.Maybe you need some time away from work to recharge. Sometimes you just need to say no. There is so much power in being able to say no, especially when you feel taken advantage of.You may lose some people along the way, but you will also feel so much weight lifted off your shoulders in the long run.Have a support system,Going through tough times alone is one of the biggest ways to fall into a hole. It’s important to have close friends or family around to support you.We would be surprised at how many people are not only going through similar situation but are also willing to help out.You just have to be willing to open up.This can be a friend, counselor, family member just go and reach out to someone.Just don’t go through tough times alone,say yourself I deserve all the support I can get.Staying positive is definitely easier said than done. Always say to yourself, I am stronger than my current circumstances. You have people out there who love and care about you willing to guide you through anything. Most importantly, you are not alone. So just Stay Positive & Stay Awesome. "
        },
        {
            "id" : 2,
            "blogCategory": "When Manifesting Your Desires...",
            "blogTitle": "Say It Like It's Already Done",
            "slug": "Say-It-Like-It's-Already-Done",
            "postedOn": "March 21, 2021",
            "author": "Pratiksha Patil",
            "blogImage": "https://images.lifealth.com/uploads/2017/10/Happy-woman-2.jpg",
            "blogText": "Say like its already done is also known as Act As If technique in words of Law Of Attraction  for someone who wants to manifest what they want into their lives, they must act as if they are already living their desire.This principle is the process of acting like you already be, do, or have the goals that you desire.The principle suggests that you should adopt the manner, pace, posture, walk, talk, breathe, think, and dress like someone who you want to be.Simply put, you must become the person in order to be, or have the things that the person already owned. In general, if you want to be successful, you must act, talk, walk, and think like how a successful person will act.The idea where you can “fake it until you make it” because our brain cannot differentiate between what is real and what is being imagined. Acting as if always works it is as real as the Law of Gravity.You cannot see gravity around you, but you can feel it. When you try to jump or throw something up in the air, it will fall down to the ground.The same goes with the principle of acting as if. You cannot see it, but it is happening deep inside your mind. So just Be Conscious of Your Feelings and Emotions, Create the relationship between What You have and What You Want. Repeat it and Let Go."
        
        },
        {
            "id": 3,
            "blogCategory": "When Manifesting Your Desires...",
            "blogTitle": "Don't Spend Time Thinking About Opposite Of What You Want",
            "slug": "Dont-Spend-Time-Thinking-About-Opposite-Of-What-You-Want",
            "postedOn": "Apr 02, 2021",
            "author": "Pratiksha Patil",
            "blogImage": "https://www.mayoclinichealthsystem.org/-/media/national-files/images/hometown-health/2019/woman-overwhelmed.jpg?la=en&hash=14B838173BCD8F2D2E6708AD6742E7DA",
            "blogText": "To create what you want, you have to have clarity. Yet, the clearer you become about what you want, the more the opposite seems to show up. It’s important to understand why that happens, so you don’t get frustrated. Without clarity about your desire, the Universe won’t know what to give you.When you know what you want, though, “All the universe conspires to help you to achieve it,” the more clarity you have about your desires, the more contrast you experience between what you have and want.Your increased clarity makes you a more powerful creator. You can give the Universe or God clear messages more consistently.Until you reach that point, you will send confusing and inconsistent messages that get mixed results. Honestly,When I have started I've not always gotten the results the way I wanted it to be but when I practice the LOA. However, I’ve also seen it work…and work well. You have to approach conscious creation with consistency and clarity.“It works if you work it.” The Law of Universe is not magical. But, if you apply yourself diligently, you will get results. One of the most common reasons you don’t get what you want is that you actually you aren’t clear about your desire. You think and say things that put mixed messages into the Universe.The Universe wants to give you your desires.But too often it thinks you want something different. As Earlier When I lie down in bed at night, I often find myself visualizing scenarios I want to avoid. When I become aware that I’m doing so, I deliberately imagine what I want.You need to do this all day long…Also, keep in mind that when you put energy into pushing away what you don’t want, you actually focus on the unwanted thing. Don’t try to get rid of what’s unwanted; instead, try to attract what is wanted.The Universe takes your thoughts and words literally. So if you aren’t getting what you want, examine what you think and say. Ensure that your thoughts and words align with your desire."

        },
        {
            "id": 4,
            "blogCategory": "When Manifesting Your Desires...",
            "blogTitle": "Meditate On What You Want",
            "slug": "Meditate-On-What-You-Want",
            "postedOn": "May 15, 2021",
            "author": "Pratiksha Patil",
            "blogImage":"https://www.verywellmind.com/thmb/3vEYHhKPh-dwTbVp8KeSx5Rp3JQ=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-536906935-56f07fd65f9b5867a1c610b8.jpg",
            "blogText": "To get the best results, you need to concentrate on good things. This is where meditating can help. Meditation helps shift to your mental attention from the chaotic mess of negative emotions to a happy and peaceful state. Emotions are our natural companions in life and nothing to be ashamed of. However, if allowed to get out of control, they can easily wreck our lives. Meditation can help in keeping them in check and shift the focus from negative emotions to positive ones. Meditation can also help in calming down the mind and bring in happiness and tranquility in life. Meditation can come in handy in getting rid of this and fill up the mind with serene and positive thoughts. Daily meditation has an amazing impact on physical as well as mental health. It even acts as a bridge between the two. There are lot of benefits of meditation like it improves focus on positive things, enhanced clarity of mind, more sense of peace and purpose greater self-acceptance, connection between mind and body, reduced levels of anxiety and panic attacks, better sleep and improved immune system. For meditation only five simple things you need to follow just find a quiet and peaceful spot, concentrate on your posture, focus on your breathing, concentrate on your thoughts, In the beginning you will find it difficult to maintain your focus even for a short duration. As you practice more and gain experience, you will find it easier, Ones you're done finish it with tranquility means notice the sounds and movements around you.Then shift your attention to your body, notice your thoughts and emotion and slowly open your eyes. You should be feeling calm and peaceful. "
        },
        {
            "id": 5,
            "blogCategory": "When Manifesting Your Desires...",
            "blogTitle": "Visualize It",
            "slug": "Visualize It",
            "postedOn": "June 21, 2021",
            "author": "Pratiksha Patil",
            "blogImage": "https://www.happierhuman.com/wp-content/uploads/2019/02/visualization-techniques.jpg",
            "blogText": "Visualization is about your heart and using heart energy to create. In visualization you are living the experience as if it was as real as you are now, as real as the screen on which you are reading these word. It’s as if your visualization is your only reality. Go beyond just having something. See how you would use it. See what it would allow you to do. Really experience the moment. Feel the moment. Feel at one with the vision. Give it a lot of love. Enjoy it and really take it to the next level. Keep practising and stay connected to it. Let the Universe make it happen. Just enjoy the ride."
        },
        {
            "id": 6,
            "blogCategory": "When Manifesting Your Desires...",
            "blogTitle": "Be Grateful As If You Have Received It",
            "slug": "Be-Grateful-As-If-You-Have-Received-It",
            "postedOn": "July 25, 2021",
            "author": "Pratiksha Patil",
            "blogImage": "https://www.tinyprints.com/inspiration/wp-content/uploads/2019/02/thank-you-quotes-5-1024x684.jpg",
            "blogText": "Being grateful or Gratitude is a powerful positive force. Far from a fluffy concept,it has real impact on physical health, emotional wellbeing, motivation, engagement and belonging. I must say gratitude is the root of the happiness. It is something that tends to focus you on what you have and replace a sense of what you might be lacking. You can’t feel both grateful and unhappy, so when your mind focuses on all you are thankful for, you’re more likely to feel joy. In addition when your more grateful for what you have, you tend to focus on the present and appreciating yourself and everything around and this can reduce a sense of yearning or anxiety about the future. Things to do on daily basis, throughout each day find small things about which you can be thankful, Make sure you are focusing on being grateful not just for things, but for people and moments as well. Write it down as note because it causes you to pause, focus, reflect and reinforce your positive experiences. Make everything count and give attention to things which make you glad. Always follow your heart, follow your dreams or desires and simply CREATE A LIFE YOU LOVE."
        }

    ]
}